Repository: stevevis/symfony
Catalog: src/Symfony/Bundle/FrameworkBundle/Resources/translations/validators.*.xliff
Languages: ro

source: This value should be false
ro: Această valoare trebuie să fie falsă (false)

source: This value should be true
ro: Această valoare trebuie să fie adevarătă (true)

source: This value should be of type {{ type }}
ro: Această valoare trebuie să fie de tipul {{ type }}

source: This value should be blank
ro: Această valoare nu trebuie să fie completată

source: This value should be one of the given choices
ro: Această valoare trebuie sa fie aleasă din opțiunile disponibile

source: You should select at least {{ limit }} choices
ro: Trebuie să selectați cel puțin {{ limit }} opțiuni

source: You should select at most {{ limit }} choices
ro: Trebuie să selectați cel mult {{ limit }} opțiuni

source: The fields {{ fields }} were not expected
ro: Nu erau așteptate câmpurile {{ fields }}

source: The fields {{ fields }} are missing
ro: Lipsesc câmpurile {{ fields }}

source: This value is not a valid date
ro: Această valoare nu reprezintă o dată validă

source: This value is not a valid datetime
ro: Această valoare nu reprezintă o dată si oră valide

source: This value is not a valid email address
ro: Această valoare nu reprezintă o adresă de e-mail validă

source: The file could not be found
ro: Fișierul nu a fost găsit

source: The file is not readable
ro: Nu a fost posibilă citirea fișierului

source: The file is too large ({{ size }}). Allowed maximum size is {{ limit }}
ro: Fișierul este prea mare ({{ size }}). Dimensiunea maximă este {{ limit}}

source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}
ro: Tipul fișierului este invalid ({{ type }}). Tipurile valide de fișiere sunt ({{ types }})

source: This value should be {{ limit }} or less
ro: Această valoare trebuie să fie cel mult {{ limit }}

source: This value is too long. It should have {{ limit }} characters or less
ro: Această valoare este prea lungă. Valoarea maximă este de {{ limit }} caractere

source: This value should be {{ limit }} or more
ro: Această valoare trebuie să fie cel puțin {{ limit }}

source: This value is too short. It should have {{ limit }} characters or more
ro: Această valoare este prea scurtă. Valoarea minimă este de {{ limit }} caractere

source: This value should not be blank
ro: Această valoare nu trebuie să fie goală

source: This value should not be null
ro: Această valoare nu trebuie să fie nulă (null)

source: This value should be null
ro: Această valoare trebuie să fie nulă (null)

source: This value is not valid
ro: Această valoare nu este validă

source: This value is not a valid time
ro: Această valoare nu este o oră validă

source: This value is not a valid URL
ro: Această valoare nu reprezintă un URL (link) valid

source: This value should be instance of class {{ class }}
ro: Această valoare trebuie să fie o instanță a clasei {{ class }}

source: This field group should not contain extra fields
ro: Aceast grup de câmpuri nu trebuie să conțină câmpuri suplimentare

source: The uploaded file was too large. Please try to upload a smaller file
ro: Fișierul încărcat este prea mare. Încărcați un fișier mai mic

source: The CSRF token is invalid. Please try to resubmit the form
ro: Token-ul CSRF este invalid. Trimiteți formularul incă o dată

source: The two values should be equal
ro: Cele două valori trebuie să fie egale

source: The file is too large. Allowed maximum size is {{ limit }}
ro: Fișierul încărcat este prea mare. Încărcați un fișier mai mic de {{ limit }}

source: The file is too large
ro: Fișierul este prea mare

source: The file could not be uploaded
ro: Fișierul nu a fost încărcat
